# Koby Hass
## Week 13 4/24/2021
### Python - Pandas DataFrame - Grouping and Mapping

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
df = DataFrame({'city': ['Alma','Brian Head', 'Fox Park','Lake Mary'],
               'altitude': [10355,9800,9062,8966]})

df

         city  altitude
0        Alma     10355
1  Brian Head      9800
2    Fox Park      9062
3   Lake Mary      8966

In [3]:
st_map={'Alma': 'Colorado', 'Brian Head': 'Utah', 'Fox Park': 'Wyoming','Lake Mary': 'California'}
st_map

{'Alma': 'Colorado',
 'Brian Head': 'Utah',
 'Fox Park': 'Wyoming',
 'Lake Mary': 'California'}

In [4]:
df['state'] = df['city'].map(st_map)

df

         city  altitude       state
0        Alma     10355    Colorado
1  Brian Head      9800        Utah
2    Fox Park      9062     Wyoming
3   Lake Mary      8966  California

In [5]:
def meter(x):
    return x / 3.2808

In [6]:
df['altitude'] = df['altitude'].apply(meter)

df

         city     altitude       state
0        Alma  3156.242380    Colorado
1  Brian Head  2987.076323        Utah
2    Fox Park  2762.131188     Wyoming
3   Lake Mary  2732.870032  California

In [7]:
df = DataFrame(np.random.randn(4,3), columns=list('bde'),
              index = ['UT','OH', 'TX', 'OR'])

df

           b         d         e
UT  1.028533  0.255727 -1.532098
OH  1.106102 -1.533271 -0.502407
TX  0.439552  1.454308 -0.134986
OR -0.071494  0.739534  1.274954

In [8]:
def dif(x):
    return x.max()-x.min()

In [9]:
df.apply(dif)

b    1.177596
d    2.987579
e    2.807052
dtype: float64

In [10]:
df.apply(dif, axis=1)

UT    2.560631
OH    2.639374
TX    1.589294
OR    1.346448
dtype: float64

In [11]:
df.apply(pd.value_counts)

             b    d    e
-1.533271  NaN  1.0  NaN
-1.532098  NaN  NaN  1.0
-0.502407  NaN  NaN  1.0
-0.134986  NaN  NaN  1.0
-0.071494  1.0  NaN  NaN
 0.255727  NaN  1.0  NaN
 0.439552  1.0  NaN  NaN
 0.739534  NaN  1.0  NaN
 1.028533  1.0  NaN  NaN
 1.106102  1.0  NaN  NaN
 1.274954  NaN  NaN  1.0
 1.454308  NaN  1.0  NaN

In [13]:
df = DataFrame({'k1': ['a','a','b','b','c'],
               'k2': ['one','two','one','two','one'],
               'dataset1': np.random.randn(5),
               'dataset2': np.random.randn(5)})

df

  k1   k2  dataset1  dataset2
0  a  one  0.643243  0.584855
1  a  two  1.188678  0.490416
2  b  one -1.177525 -0.526494
3  b  two -0.882807 -2.044035
4  c  one  0.767431 -1.872422

In [14]:
df.groupby('k1').count()

    k2  dataset1  dataset2
k1
a    2         2         2
b    2         2         2
c    1         1         1

In [15]:
df.groupby(['k1','k2']).count()

        dataset1  dataset2
k1 k2
a  one         1         1
   two         1         1
b  one         1         1
   two         1         1
c  one         1         1

In [16]:
df['dataset1'].groupby(df['k1']).mean()

k1
a    0.915961
b   -1.030166
c    0.767431
Name: dataset1, dtype: float64

In [17]:
df.groupby('k1').size()

k1
a    2
b    2
c    1
dtype: int64

In [18]:
df.groupby('k1').mean()

    dataset1  dataset2
k1
a   0.915961  0.537636
b  -1.030166 -1.285265
c   0.767431 -1.872422

In [21]:
df.groupby(['k1','k2']).mean()

        dataset1  dataset2
k1 k2
a  one  0.643243  0.584855
   two  1.188678  0.490416
b  one -1.177525 -0.526494
   two -0.882807 -2.044035
c  one  0.767431 -1.872422

In [ ]:
group = df.groupby(['k1','k2'])[['dataset1']]

group.